src/Catalogs/Scan_Запросы/Scan_Запросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_Запросы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИмяПараметра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПараметра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Колонки</name>
    <attributes>
      <name>ИмяКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_Запросы/Forms/ФормаЭлемента/Module.bsl
// rarus tenkam 23.08.2017 mantis 8465 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВыбора = Элементы.ТипПараметра.СписокВыбора;
	
	Для Каждого Справочник ИЗ Метаданные.Справочники Цикл
		
		СписокВыбора.Добавить("Справочник." + Справочник.Имя, "Справочник: " +Справочник.Синоним);
		
	КонецЦикла;
	
	Для Каждого Документ ИЗ Метаданные.Документы Цикл
		
		СписокВыбора.Добавить("Документ." + Документ.Имя, "Документ: " +Документ.Синоним);
		
	КонецЦикла;
	
	Для Каждого БизнесПроцесс ИЗ Метаданные.БизнесПроцессы Цикл
		
		СписокВыбора.Добавить("БизнесПроцесс." + БизнесПроцесс.Имя, "БизнесПроцесс: " +БизнесПроцесс.Синоним);
		
	КонецЦикла;
	
	Для Каждого Задача ИЗ Метаданные.Задачи Цикл
		
		СписокВыбора.Добавить("Задача." + Задача.Имя, "Задача: " +Задача.Синоним);
		
	КонецЦикла;
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ПустаяСтрока(СокрЛП(ТекущийОбъект.ТекстЗапроса)) Тогда
		
		ТекущийОбъект.Колонки.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТестовыйДокумент.Ссылка
		|ИЗ
		|	" + Объект.ТипПараметра + " КАК ТестовыйДокумент";
		ВремОтказ = Ложь;
		Попытка
			Выборка = Запрос.Выполнить().Выбрать();
		Исключение
			ВремОтказ = Истина;
		КонецПопытки;
			
		Если НЕ ВремОтказ И Выборка.Следующий() Тогда
			
			Запрос.Текст = Объект.ТекстЗапроса;
			Запрос.УстановитьПараметр("Ссылка", Выборка.Ссылка);
			Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
			Запрос.УстановитьПараметр("ТекущийПользователь", ПользователиКлиентСервер.ТекущийПользователь());
			ВремОтказ = Ложь;
			Попытка
				Результат = Запрос.Выполнить();
			Исключение
				Сообщить(ОписаниеОшибки());
				//Отказ = Истина;
				//Возврат; 
				ВремОтказ = Истина;
			КонецПопытки;
			
			Если НЕ ВремОтказ Тогда
				
				Для Каждого КолонкаЗапроса ИЗ Результат.Колонки Цикл
					
					НовыйЭлемент = ТекущийОбъект.Колонки.Добавить();
					НовыйЭлемент.ИмяКолонки = КолонкаЗапроса.Имя;
					НовыйЭлемент.Представление = КолонкаЗапроса.Имя;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			//rarus FominskiyAS 19.04.2019 mantis 14191 +++
			//Сообщить("Не удалось заполнить параметр " + Объект.ТипПараметра);
			Сообщить(НСтр("ru = 'Не удалось заполнить параметр '; en = 'Action failed  '") + Объект.ТипПараметра);
			//rarus FominskiyAS 19.04.2019  mantis 14191 ---  
			//Отказ = Истина;
			//Возврат;
		КонецЕсли;
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 +++
	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 --- 
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗапроса(Команда)
	// rarus tenkam 10.04.2019 mantis 14195 +++
	//#Если ТонкийКлиент Тогда
	//	Предупреждение("Невозможно использование конструктора запросов в данном режиме");
	//#Иначе
	//	Если Не ПустаяСтрока(СокрЛП(Объект.ТекстЗапроса)) Тогда
	//		КонструкторЗапроса = Новый КонструкторЗапроса(Объект.ТекстЗапроса);
	//	Иначе
	//		КонструкторЗапроса = Новый КонструкторЗапроса;
	//	КонецЕсли;
	//	
	//	Если КонструкторЗапроса.ОткрытьМодально() Тогда
	//		Объект.ТекстЗапроса = КонструкторЗапроса.Текст;
	//	КонецЕсли;
	//#КонецЕсли
	
	ТекстЗапросаВФорме = СокрЛП(Объект.ТекстЗапроса);
	
	КонструкторЗапроса = Новый КонструкторЗапроса(ТекстЗапросаВФорме);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияКонструктораЗапроса", ЭтотОбъект, );
	КонструкторЗапроса.Показать(Оповещение);
	// rarus tenkam 10.04.2019 mantis 14195 ---
КонецПроцедуры
// rarus tenkam 23.08.2017 mantis 8465 ---

// rarus tenkam 10.04.2019 mantis 14195 +++
&НаКлиенте
Процедура ПослеЗакрытияКонструктораЗапроса(РезультатОповещения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатОповещения <> Неопределено Тогда
		Объект.ТекстЗапроса = РезультатОповещения;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры
// rarus tenkam 10.04.2019 mantis 14195 ---
